Revit 2024 API
StructuralSectionRectangleParameterized Class
 Defines parameters for parameterized rectangle structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionRectangleParameterized : StructuralSectionGeneralF
Visual Basic
Public Class StructuralSectionRectangleParameterized _
	Inherits StructuralSectionGeneralF
Visual C++
public ref class StructuralSectionRectangleParameterized : public StructuralSectionGeneralF
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized
See Also
StructuralSectionRectangleParameterized Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace